2024/06/10/processing-the-data-offline/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Processing MicroMoth recordings offline | Simon Dobson</title>
<link rel="icon" href="../../../../images/favicon.png" sizes="16x16">
<link rel="alternate" type="application/rss+xml" href="../../../../rss.xml">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono|Libre+Baskerville|Montserrat|Playfair+Display|Tangerine">
<link rel="stylesheet" href="../../../../assets/css/libretto_styles.css">
<link rel="stylesheet" href="../../../../assets/css/baguetteBox.min.css">
<link rel="stylesheet" href="../../../../assets/css/code.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_rst.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_ipython.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
	    <h1 class="site-title">
		<a href="https://simondobson.org/" title="Simon Dobson" rel="home">Simon&nbsp;Dobson</a>
	    </h1>
	</div>
	<nav class="site-navigation" role="navigation"><div class="menu-toggle">
		<span class="mobile-site-title">Simon Dobson</span>
	    </div>
	    <ul class="menu">
<li><a href="../../../../index.html">Home</a></li>
		    <li><a href="../../../../personal/">About&nbsp;me</a></li>
		    <li><a href="../../../../research/">Research</a></li>
		    <li><a href="../../../../development/projects/">Software</a></li>
		    <li><a href="../../../../writing/">Writing</a></li>
		    <li><a href="../../../../personal/contact/">Contact</a></li>
		<li>
<a href="../../../../rss.xml"><i class="fa fa-rss"></i></a>
	    </li>
</ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
	<div class="entry-meta">
	    <span class="posted-on">
		Posted on <a href="." rel="bookmark">Monday 10 June, 2024</a>
	    </span>
	</div>
	<h1>Processing MicroMoth recordings&nbsp;offline</h1>
    </div>

	<!-- Page Content -->
    <div class="site-content" role="main">
	<article class="format-standard libretto-long-form"><div class="entry-content">
		<div id="outline-container-orgfccf4b6" class="outline-2">
<h2 id="orgfccf4b6">Processing MicroMoth recordings&nbsp;offline</h2>
<div class="outline-text-2" id="text-orgfccf4b6">
<p>
The uMoth&nbsp;generates <code>.wav</code> files, uncompressed waveforms of what it
records. These need to be processed to identify any bird calls
within&nbsp;them.
</p>

<p>
This function is integrated in BirdNET-Pi, which does recording and
classification, and provides a web <span class="caps">GUI</span>. With the uMoths we need to
provide classification as part of a data processing pipeline. We
can however make direct use of the classifier &#8220;brain&#8221; within
BirdNET-<span class="caps">PI</span>, which is unsurprisingly called <a href="https://github.com/kahst/BirdNET-Analyzer">BirdNET-Analyzer</a>.
</p>
</div>

<div id="outline-container-org1ca5243" class="outline-3">
<h3 id="org1ca5243">Installation</h3>
<div class="outline-text-3" id="text-org1ca5243">
<p>
I&#8217;m working on a 16-core Intel Core i7@3.8GHz running Arch&nbsp;Linux.
</p>

<p>
First we clone the BirdNET-Analyzer repo. This takes a long time
as it includes the <span class="caps">ML</span> models, some of which are <span class="caps">40MB</span> or&nbsp;more.
</p>

<div class="highlight"><pre><span></span>    git clone https://github.com/kahst/BirdNET-Analyzer.git
    cd BirdNET-Analyzer
</pre></div>

<p>
The repo includes a Docker file that we can use to build the
analyser in a&nbsp;container.
</p>

<div class="highlight"><pre><span></span>    docker build .
</pre></div>

<p>
The container setup is quite basic and is probably intended for
testing rather than production, but it gives a usable system that
could then be embedded into something more usable. The core of the
system is&nbsp;the <code>analyze.py</code> script.
</p>
</div>
</div>

<div id="outline-container-orge6466b1" class="outline-3">
<h3 id="orge6466b1">Analysing some data (<span class="caps">AKA</span> identifying some&nbsp;birds!)</h3>
<div class="outline-text-3" id="text-orge6466b1">
<p>
The container as defined looks into&nbsp;its <code>/example</code> directory for
waveforms and analyses them, generating text file for each sample.
The easiest way to get it to analyse captured data is to mount a
data directory of files onto this mount point (thereby shadowing
the example waveform&nbsp;provided).
</p>

<p>
There are various parameters that configure the classifier. I
copied the <a href="/2024/05/19/first-installation/">defaults I was using with BirdNET-Pi</a>, only accepting classifications
at or above 0.7&nbsp;confidence.
</p>

<div class="highlight"><pre><span></span>    docker run -v /var/run/media/sd80/DATA:/example birdnet-analyzer analyze.py --rtype=csv --min_conf=0.7 --sensitivity=1.25
</pre></div>

<p>
This crunches through all the files (982 of them from my first
run) and generates a <span class="caps">CSV</span> file for each. An example&nbsp;is:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-right">
<col class="org-right">
<col class="org-left">
<col class="org-left">
<col class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-right">Start (s)</td>
<td class="org-right">End (s)</td>
<td class="org-left">Scientific name</td>
<td class="org-left">Common name</td>
<td class="org-right">Confidence</td>
</tr>
<tr>
<td class="org-right">6.0</td>
<td class="org-right">9.0</td>
<td class="org-left">Corvus monedula</td>
<td class="org-left">Eurasian Jackdaw</td>
<td class="org-right">0.9360</td>
</tr>
<tr>
<td class="org-right">9.0</td>
<td class="org-right">12.0</td>
<td class="org-left">Corvus monedula</td>
<td class="org-left">Eurasian Jackdaw</td>
<td class="org-right">0.8472</td>
</tr>
<tr>
<td class="org-right">12.0</td>
<td class="org-right">15.0</td>
<td class="org-left">Corvus monedula</td>
<td class="org-left">Eurasian Jackdaw</td>
<td class="org-right">0.8681</td>
</tr>
<tr>
<td class="org-right">15.0</td>
<td class="org-right">18.0</td>
<td class="org-left">Corvus monedula</td>
<td class="org-left">Eurasian Jackdaw</td>
<td class="org-right">0.8677</td>
</tr>
<tr>
<td class="org-right">24.0</td>
<td class="org-right">27.0</td>
<td class="org-left">Columba palumbus</td>
<td class="org-left">Common Wood-Pigeon</td>
<td class="org-right">0.9198</td>
</tr>
<tr>
<td class="org-right">27.0</td>
<td class="org-right">30.0</td>
<td class="org-left">Columba palumbus</td>
<td class="org-left">Common Wood-Pigeon</td>
<td class="org-right">0.7716</td>
</tr>
<tr>
<td class="org-right">45.0</td>
<td class="org-right">48.0</td>
<td class="org-left">Corvus monedula</td>
<td class="org-left">Eurasian Jackdaw</td>
<td class="org-right">0.8023</td>
</tr>
<tr>
<td class="org-right">48.0</td>
<td class="org-right">51.0</td>
<td class="org-left">Corvus monedula</td>
<td class="org-left">Eurasian Jackdaw</td>
<td class="org-right">0.7696</td>
</tr>
</tbody>
</table>
<p>
Those are entirely credible identifications. The start- and
end-point offsets allow rough location within the recording.
(BirdNET segments the recordings into 3s chunks for&nbsp;analysis.)
</p>

<p>
This is clearly not as straightforward as BirdNET-Pi, nor as
immediately satisfying. But it does scale to analysing lots of
data (and could be made to do so even better, with a better
front-end to the container), which is important for any
large-scale&nbsp;deployment.
</p>
</div>
</div>
</div>
	    </div>

		<div>
		  (Part of the series
		  <a href="../../../../development/acoustic-birds/">Bird counting with acoustic sensing</a>.)
		</div>

	</article>
</div>

	<!-- Social sharing section -->
  <div class="site-content">
    <div class="social">
      <ul>
<li><a onclick="MastodonShare(this);" data-src="Processing%20MicroMoth%20recordings%20offline%20%23acoustic%20%23project%3Aacoustic-birds%20%23sensing&amp;url=https://simondobson.org/2024/06/10/processing-the-data-offline/"><span title="Share on Mastodon"><i class="fab fa-mastodon"></i></span></a></li>
	<li><a href="https://twitter.com/share?text=Processing%20MicroMoth%20recordings%20offline%20%23acoustic%20%23project%3Aacoustic-birds%20%23sensing&amp;url=https://simondobson.org/2024/06/10/processing-the-data-offline/" target="_blak"><span title="Share on Twitter"><i class="fab
	fa-twitter"></i></span></a></li>
	<li><a href="https://www.reddit.com/submit?url=https://simondobson.org/2024/06/10/processing-the-data-offline/&amp;title=Processing%20MicroMoth%20recordings%20offline%20%23acoustic%20%23project%3Aacoustic-birds%20%23sensing" target="_blank"><span title="Share on Reddit"><i class="fab fa-reddit"></i></span></a></li>
	<li><a href="https://www.linkedin.com/shareArticle?url=https://simondobson.org/2024/06/10/processing-the-data-offline/&amp;source=https://simondobson.org/" target="_blank"><span title="Share on LinkedIn"><i class="fab fa-linkedin"></i></span></a></li>
	<li><a href="mailto:?subject=Processing%20MicroMoth%20recordings%20offline&amp;body=https://simondobson.org/2024/06/10/processing-the-data-offline/"><span title="Share by email"><i class="fa fa-envelope"></i></span></a></li>
      </ul>
</div>
  </div>

	<!-- Tag Section -->
    <div class="site-content navigation-post">
	<div class="tag-head">Tags</div>
	<div class="tag-list">
		<a href="../../../../categories/acoustic/">acoustic</a>
		    <span>  </span>
		<a href="../../../../categories/projectacoustic-birds/">project:acoustic-birds</a>
		    <span>  </span>
		<a href="../../../../categories/sensing/">sensing</a>
	</div>
    </div>

	<!-- Post Navigation links -->
<nav class="site-content navigation-post" role="navigation"><div class="previous">
	    <a href="../configuring-the-board/" rel="prev">
		<span class="meta-nav">Older Post</span>Deploying a MicroMoth
	    </a>
	</div>
	<div class="next">
	    <a href="../../14/lisp-macros-versus-rust-macros/" rel="next">
		<span class="meta-nav">Newer Post</span>Lisp macros /versus/ Rust macros
	    </a>
	</div>
</nav><!-- Page Footer --><section class="footer-sidebar clear" role="complementary"><div class="widget-block">
	    <aside class="widget"><h2 class="widget-title">Simon&nbsp;Dobson</h2>
		<div class="widget-text">Aut tace aut loquere meliora silentio</div>
	    </aside>
</div>
    </section><!-- Extra JavaScript --><script src="../../../../assets/js/mastodon-share.js"></script><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
	    <p></p>
	    <p>
	      Built with free and open-source software.
	      Powered by <a href="https://getnikola.com/">Nikola</a> using a theme based on
	      <a href="https://themes.getnikola.com/v7/libretto/">Libretto</a>.
	    </p>
	    <p>
	      All content Copyright © 2010–2024 Simon Dobson and licensed under
	      <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/"><span class="caps">CC</span>-<span class="caps">BY</span>-<span class="caps">NC</span>-<span class="caps">SA</span>-4.0</a>
	      unless otherwise&nbsp;noted.
	    </p>
	</div>
	<div class="social">
	    <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>